app/controllers/friends_controller.rb

  def index
    @friends = Friend.all
---
SELECT "friends".* FROM "friends"

  def create
    #@friend = Friend.new(friend_params)
    @friend = current_user.friends.build(friend_params)

    respond_to do |format|
      if @friend.save
---
INSERT INTO "friends" ("first_name", "last_name", "email", "phone", "twitter", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @friend.destroy
---
DELETE FROM "friends" WHERE "friends"."id" = ?  [["id", 10]]

  def correct_user
    @friend = current_user.friends.find_by(id: params[:id])
---
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ? AND "friends"."id" = ? LIMIT ?  [["user_id", 6], ["id", 8], ["LIMIT", 1]]

    def set_friend
      @friend = Friend.find(params[:id])
---
SELECT "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]